Revit 2024 API
LinkNode.SymbolId Property
 Identifies the Id of the symbol associated with the node.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public ElementId SymbolId { get; }
Visual Basic
Public ReadOnly Property SymbolId As ElementId
	Get
Visual C++
public:
property ElementId^ SymbolId {
	ElementId^ get ();
}
See Also
LinkNode Class
Autodesk.Revit.DB Namespace